'''Задача 3. Чёт-нечёт'''

x = int(input('Введите число: '))

if x % 2 == 0:
  print('Это четное число')
else:
  print('Это нечетное число')